In [9]:
import numpy as np
import pandas as pd
import statsmodels.api as sm
from re import sub
import matplotlib.pyplot as plt
from decimal import Decimal
import warnings
import seaborn as sns
sns.set()

from sklearn.cluster import KMeans
from sklearn.linear_model import LinearRegression
warnings.filterwarnings('ignore')

In [3]:
data_degree_that_pay_back = pd.read_csv('datasets_1189_2137_degrees-that-pay-back.csv')
data_degree_that_pay_back.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Percent change from Starting to Mid-Career Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Accounting,"$46,000.00","$77,100.00",67.6,"$42,200.00","$56,100.00","$108,000.00","$152,000.00"
1,Aerospace Engineering,"$57,700.00","$101,000.00",75.0,"$64,300.00","$82,100.00","$127,000.00","$161,000.00"
2,Agriculture,"$42,600.00","$71,900.00",68.8,"$36,300.00","$52,100.00","$96,300.00","$150,000.00"
3,Anthropology,"$36,800.00","$61,500.00",67.1,"$33,800.00","$45,500.00","$89,300.00","$138,000.00"
4,Architecture,"$41,600.00","$76,800.00",84.6,"$50,600.00","$62,200.00","$97,000.00","$136,000.00"

In [ ]:
for col in range(1,2):
    for i in range(len(data_degree_that_pay_back)):
        data_degree_that_pay_back.iloc[i][col] = sub(r'[^\d.]', '', data_degree_that_pay_back.iloc[i][col])

In [4]:
data_salaries_by_college = pd.read_csv('datasets_1189_2137_salaries-by-college-type.csv')
data_salaries_by_college.head()

,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Massachusetts Institute of Technology (MIT),Engineering,"$72,200.00","$126,000.00","$76,800.00","$99,200.00","$168,000.00","$220,000.00"
1,California Institute of Technology (CIT),Engineering,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,Engineering,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"Polytechnic University of New York, Brooklyn",Engineering,"$62,400.00","$114,000.00","$66,800.00","$94,300.00","$143,000.00","$190,000.00"
4,Cooper Union,Engineering,"$62,200.00","$114,000.00",NaN,"$80,200.00","$142,000.00",NaN

In [5]:
data_salaries_by_region = pd.read_csv('datasets_1189_2137_salaries-by-region.csv')
data_salaries_by_region.head()

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN

In [13]:
data_field_of_study = pd.read_csv('FieldOfStudyData1415_1516_PP.csv')
data_field_of_study.describe(include= 'all')

,P_UNITID,P_OPEID6,P_INSTNM,P_CONTROL,P_MAIN,P_CIPCODE,P_CIPDESC,P_CREDLEV,P_CREDDESC,P_COUNT,P_DEBTMEDIAN,P_DEBTPAYMENT10YR,P_DEBTMEAN,P_TITLEIVCOUNT,P_EARNINGSCOUNT,P_MD_EARN_WNE,P_IPEDSCOUNT1,P_IPEDSCOUNT2
count,205544.000000,209368.000000,209368,209368,209368.000000,209368.000000,209368,209368.000000,209368,209368,209368,209368,209368,0.0,0.0,0.0,183685.000000,183733.000000
unique,NaN,NaN,7715,4,NaN,NaN,395,NaN,8,519,16181,1720,29930,NaN,NaN,NaN,NaN,NaN
top,NaN,NaN,Pennsylvania State University-Main Campus,Public,NaN,NaN,"Business Administration, Management and Operat...",NaN,Bachelors Degree,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed,PrivacySuppressed,NaN,NaN,NaN,NaN,NaN
freq,NaN,NaN,471,118240,NaN,NaN,6623,NaN,67358,198554,160006,160006,138645,NaN,NaN,NaN,NaN,NaN
mean,207108.115532,6800.819079,NaN,NaN,0.921478,3354.690922,NaN,3.127808,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.507722,27.657536
std,91651.096087,9021.444745,NaN,NaN,0.268992,1711.217342,NaN,1.825476,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,85.627790,87.544988
min,100654.000000,1002.000000,NaN,NaN,0.000000,100.000000,NaN,1.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.000000,0.000000
25%,150604.000000,2076.000000,NaN,NaN,1.000000,1500.000000,NaN,2.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2.000000,2.000000
50%,189578.500000,3223.000000,NaN,NaN,1.000000,4005.000000,NaN,3.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8.000000,8.000000
75%,224642.000000,6960.000000,NaN,NaN,1.000000,5107.000000,NaN,5.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,25.000000,25.000000
max,490018.000000,42817.000000,NaN,NaN,1.000000,6005.000000,NaN,8.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8831.000000,8911.000000